public class 자바OOP {
    public static void main(String[] args) {
        /*
        자바 OOP
        객체지향 프로그래밍
        절차 프로그래밍은 데이터에 대한 작업을 수행하는 절차나 방법을 작성하는 것이며
        객체 지향 프로그래밍은 데이터와 방법을 모두 포함하는 객체를 생성하는 것입니다
        더빠르고 실행하기 쉽다
        프로그램에 대한 명확한 구조
        java코드를 dry don't repeat yourself 유지하고 코드를 유지 수정및 디버깅하는데 도움됩니다
        코드의 반복을 줄이는 것입니다(자신을 반복하지 마세요)
        공통적으로 사용되는 코드를 추출하여 반복하지 말고 한곳에 배치하여 재사용해야합니다
        클래스와 객체는 무엇입니까?
        물건들
        사과 바나나 망고
        클래스는 객체의 템플릿이고 객체는 클래스의 인스턴스 입니다
        개별 객체가 생성되면 클래스의 모든 변수와 메서드를 상속합니다

         */
    }
}
